---
kind: property
id: P:Autodesk.Revit.DB.FamilySymbolProfile.XOffset
source: html/6abdc02b-944b-610e-2f77-01ad859268a7.htm
---
# Autodesk.Revit.DB.FamilySymbolProfile.XOffset Property

The offset of the profile to the origin of the sketch plane in the X direction.

## Syntax (C#)
```csharp
public double XOffset { get; set; }
```